{
    "projects": [
        {
            "id": "wilson-internship",
            "title": "Data Analyst Internship",
            "subtitle": "Wilson Sporting Goods",
            "description": ["The summer before my junior year, I worked as a Data Analyst Intern for Wilson Sporting Goods. My work centered around the Wilson Connected Football, a ball that collects statistics like exit velocity and spin rate every time it’s thrown. At the start of the internship, I was given data spanning almost a decade spread across hundreds of folders and tasked with centralizing it into a single database. I accomplished this task in under a week, and then used that database to explore numerous other questions of interest to drive growth both for the company and for the quarterbacks using the ball.", 
                            "Over the course of the internship, I spearheaded projects covering a wide range of fields. Highlights included creating a machine learning model that was able to categorize throws with 85% accuracy, creating predictive metrics to analyze likelihood of player success in key areas, developing novel data visualizations to increase customer interaction with the Wilson platform, and identifying areas for growth in market share and brand awareness.", 
                            "The work I completed had an immediate and significant impact at Wilson. I prototyped visuals that are now key pieces of the Wilson Connected web portal and developed methods for transforming statistics that are currently being used on the portal’s backend. In addition, trends that I identified and summarized were used in meetings with major clients as proof of our system’s success and validity.", 
                            "Working at Wilson also gave me valuable exposure to business analytics and operations management. From meeting one-on-one with mentors on the cutting edge of sales analytics learning about their efforts to modernize company procedures, attending lunch-and-learns with senior company leaders who shared their work and career paths, and collaborating with everyone from product line managers to software engineers, I gained a firm understanding of fundamental business concepts and the ways I could contribute to the success of the company.", 
                            "My projects gave me real-world experience using software development tools for data analysis including Python, Pandas, Numpy, Scikit-Learn, Jupyter Notebooks, Matplotlib, and Plotly as well as software in the Microsoft suite, including Excel, Powerpoint, and Word. I was also introduced to agile development frameworks using tools like Jira and Confluence."],
            "tags": ["Internship", "Data Science", "Python", "Machine Learning", "Pandas", "scikit-learn", "Excel", "Jupyter Notebook"],
            "thumbnail_src": "./assets/images/wilson-logo.png",
            "img1_src": "./assets/images/wilson-connected-football.png",
            "img1_cap": "An inside look at the Connected Football.",
            "img2_src": null,
            "img2_cap": null
        },
        {
            "id": "chsh-simulation",
            "title": "Quantum Game Simulator",
            "subtitle": "Research Intern",
            "description": ["The summer after my freshman year of college, I volunteered with professors at the University of Illinois at Chicago and the University of Chicago’s Chicago Quantum Exchange to do research in quantum computing.",
                            "Under the guidance of Dr. Zizwe Chase and Dr. Russell Ceballos, I dove deep into the world of “quantum games,” games where strategies that take advantage of phenomena like quantum entanglement are able to outperform the best “classical” strategy. I specifically studied the CHSH game, a cooperative game where two players try to produce optimal outputs given certain signals from a neutral referee.",
                            "My project had two stages. In the first, I created an interactive version of the game run in a Python notebook. This version was an educational tool; it provided an introduction to quantum science for someone with no background knowledge whatsoever, explaining the basic principles being used and then walking them through the game itself and allowing them to try different strategies, demonstrating – not just telling – the advantage of quantum strategies.",
                            "The second stage was using the quantum network simulator SeQUeNCe to develop and demonstrate network protocols that enabled the CHSH game to be run on spatially separated quantum computers. This simulation was groundbreaking in demonstrating for the first time that, with the proper protocols, quantum advantage could be actualized for computers sitting cities or countries apart. It also provided validation for the highly touted potential use of quantum games as a measure of entanglement between two computers, by demonstrating that, with imperfect entanglement, the game degenerated to the classical win rate.",
                            "After the summer ended, I continued collaborating with the professors who had mentored me, and summarized these findings and their significance in a draft paper. Both programs are publicly available on <a href=\"https://github.com/DMcDe/CHSH-game-introduction\" target=\"_blank\">my Github</a>."],
            "tags": ["Physics", "Quantum Computing", "Python", "Qiskit", "Jupyter Notebook", "Research", "Networks", "SeQUeNCe"],
            "thumbnail_src": "./assets/images/qiskit-logo.png",
            "img1_src": null,
            "img1_cap": null,
            "img2_src": null,
            "img2_cap": null
        },
        {
            "id": "quantum-club",
            "title": "QuantUM",
            "subtitle": "Cofounder, Michigan Undergraduate Quantum Club",
            "description": ["In order to share my passion for quantum computing with other undergraduates and to build a community for those interested in quantum science, I co-founded Michigan’s first and only club focused on quantum science and technology, QuantUM. To establish a firm foundation for the club, I contacted Michigan’s Electrical and Computer Engineering department, who agreed to sponsor the club as an official university organization, and reached out to peers and professors to help lead and advise QuantUM.",
                            "Starting QuantUM has taught me lessons about leadership, organization, marketing, and community-building. Serving as a founding member of the executive board has involved planning club meetings, contacting experts from both inside and outside the university to speak to our members, conducting outreach and advertising to build awareness of our mission on campus, and managing budgets and facilities; it has helped me understand what makes a team successful and how to meet people where they are to create buy-in and excitement around your goals and endeavors.",
                            "Leading the club has also been incredibly rewarding. Bringing those who are already interested and aware of quantum technologies together has been just as impactful as introducing newcomers and sparking organic curiosity around the field. I am excited to see the quantum community grow at Michigan and know it will last far into the future.",
                            "The club has also benefited from support and <a href=\"https://ece.engin.umich.edu/stories/new-quant-um-organization-empowers-undergrads-interested-in-quantum-science-and-technology\" target=\"_blank\">publicity</a> from Michigan ECE, for which I am incredibly grateful."],
            "tags": ["Physics", "Quantum Computing", "Qiskit", "Leadership", "Fundraising"],
            "thumbnail_src": "./assets/images/quantum-logo.png",
            "img1_src": null,
            "img1_cap": null,
            "img2_src": null,
            "img2_cap": null
        },
        {
            "id": "nfl-win-predictor",
            "title": "In-Game NFL Win Predictor",
            "subtitle": "Project Lead, WSA",
            "description": ["My first semester as a project lead in Wolverine Sports Analytics, I oversaw an effort to create an <a href = \"https://www.wolverinesportsanalytics.com/projects/nfl-ingame-win-predictor\" target=\"_blank\">in-game predictor</a> for NFL games. Over the course of a semester, my team devised mathematical formulas to turn a team’s position on the field and year-long statistics into an expected amount of points on the current drive and remainder of the game. Using that Expected Points metric, we were able to predict the final score of the game at any given moment, and use that expected point differential to assign a Win Probability to each team.",
                            "My goal in leading the project was to create a model that was understandable and designed with intention. While I had worked on multiple projects that utilized machine learning and neural networks to predict outcomes, I was interested in making something that wasn’t a black box, where I was directly involved in the formulation of the decision making process. I found this process uniquely engaging; strategizing what mathematical functions best produced the given output and testing and revising along the way was a puzzle unlike any other.",
                            "Our finished model is not only able to generate an expected win probability for an NFL team given any opponent and in-game situation, but is also able to calculate how that win probability changes with key strategic decisions. By comparing the expected points for a team after kicking a field goal versus attempting to reach a first down, for example, the model is able to identify which option leads to the highest likelihood of winning the game, and is a valuable tool for guiding and validating coaching decisions."],
            "tags": ["Sports Analytics", "Data Science", "Python", "Linear Regression", "Math", "Leadership"],
            "thumbnail_src": "./assets/images/WSA-logo.png",
            "img1_src": null,
            "img1_cap": null,
            "img2_src": null,
            "img2_cap": null
        },
        {
            "id": "nutristat",
            "title": "Dining Hall Nutrition Website",
            "subtitle": "1st Place Hackathon Project Member",
            "description": ["In spring of 2024, I competed in a hackathon hosted by Kappa Theta Pi, a professional technology fraternity I have been a member of since freshman year. The hackathon was a day long, and challenged participants to create something that would be helpful in the everyday life of a student.",
                            "On a team with four of my peers, I created a website that aggregated the nutrition information of all items from the University of Michigan dining hall menu called NutriStat. My role on the team was creating a model to transform the nutritional statistics of the food into a single score that was simple but meaningful. In order to create a metric that was grounded in science, I did research on nutritional guidelines from trusted organizations and devised a method that gave ratings on five key aspects of nutrition that were then combined into a single score.",
                            "I also created a visual representation of the score to be included along with each food item on the website. When drafting this visualization, I focused on readability and ease of understanding; I strove to create something that could quickly communicate the overall rating at a glance, but also gave more context to the rating to enable the user to make their own dietary decisions.",
                            "The experience was truly rewarding: I loved the grind and hustle of trying to finish as much as possible with the clock ticking, and I grew closer to my friends and teammates as a result. It taught me about the importance of communication and collaboration and gave me hands-on experience building a product as a team using tools for codesharing and task management. As validation of my team’s effort, our project was awarded first place out of all entries by a panel of judges."],
            "tags": ["Hackathon", "Python", "Pandas", "matplotlib", "Git", "HTML/CSS", "Award", "Software Development"],
            "thumbnail_src": "./assets/images/nutrition-clipart.png",
            "img1_src": "./assets/images/nutristat-score-graphic.png",
            "img1_cap": "An example of a food score icon.",
            "img2_src": null,
            "img2_cap": null
        },
        {
            "id": "march-madness-scorecards",
            "title": "March Madness Scorecards",
            "subtitle": "Personal Project",
            "description": ["As a lifelong March Madness enthusiast, I have always found myself spending days working on completing my bracket, opening up multiple different sources for statistics for each team and constantly switching between tabs and windows to try and make an informed pick. After the release of the 2024 bracket, I had had enough; I decided to forego filling out my bracket until I had created a tool that would automatically aggregate data from every source I relied on and create a single dashboard with relevant statistics for both teams.",
                            "With the clock ticking (I refused to make my picks until after I had finished the project and there are just a few days from Selection Sunday to tipoff) I dove into coding, using Python to generate a program that would take as input the two teams competing in a hypothetical matchup and return a scorecard that displayed their statistics.",
                            "I split my project into three primary components: scraping the data, cleaning it for usability, and displaying it for ease of access. For scraping, I used the BeautifulSoup library, and gathered metrics from KenPom, College Basketball Reference, and ESPN. I did some filtering and reformatting behind the scenes, and then used matplotlib to create custom tables and grids for organizing the data.",
                            "I finished the scorecards the night before games kicked off, creating visuals that were organized and informative and brought statistics from multiple different sites into a single source, saving me the hassle of opening up multiple new tabs per team each time I moved to deciding a new game.",
                            "The code for the project, which I hope to update in preparation for the upcoming tournament, can be found on <a href=\"https://github.com/DMcDe/march-madness-scorecards\" target=\"_blank\">Github</a>. I programmed using the Spyder IDE in an Anaconda environment."],
            "tags": ["Sports Analytics", "Python", "Spyder", "matplotlib", "Pandas", "BeautifulSoup", "Anaconda"],
            "thumbnail_src": "./assets/images/march-madness-logo.png",
            "img1_src": "./assets/images/march-madness-scorecard.png",
            "img1_cap": "An example scorecard from the 2024 tournament.",
            "img2_src": null,
            "img2_cap": null
        },
        {
            "id": "march-madness-predictor",
            "title": "March Madness Predictor",
            "subtitle": "Project Member, WSA",
            "description": ["Since the first semester of my freshman year, I have been a member of Wolverine Sports Analytics, a club dedicated to applying computer and data science techniques to analyzing players and teams and predicting match outcomes in all areas of athletics.",
                            "After a semester of onboarding, where I was introduced to tools like MySQL, Pandas, BeautifulSoup, and TensorFlow, I joined my first project team, working on a Machine Learning model to predict the outcome of the NCAA March Madness tournament.",
                            "I led the web scraping portion of the project, where I wrote scripts to comb through dozens of statistical categories for every Division I men's basketball team going back over a decade. The process involved collecting tens of thousands of data points that I organized into a SQL database for use for training and testing our model.",
                            "Using TensorFlow, we created a deep neural network that used the statistics I had scraped to assign a power ranking to each team in the tournament. After backtesting on previous tournaments, we entered our model into ESPN’s 2023 tournament challenge, where it ranked in the top 80th percentile of over 20 million bracket entries worldwide.",
                            "You can read more about the project on <a href=\"https://www.wolverinesportsanalytics.com/projects/march-madness\" target=\"_blank\">WSA’s website</a>."],
            "tags": ["Sports Analytics", "Python", "Spyder", "BeautifulSoup", "Machine Learning", "Linear Regression", "MySQL"],
            "thumbnail_src": "./assets/images/WSA-logo.png",
            "img1_src": "./assets/images/march-madness-predictor-bracket.png",
            "img1_cap": "Our predictions for the West region of 2023's bracket.",
            "img2_src": null,
            "img2_cap": null
        },
        {
            "id": "debate-scraper",
            "title": "Policy Debate Statistics Scraper",
            "subtitle": "Personal Project",
            "description": ["Having competed in national circuit policy debate throughout high school and into college, including winning the 2022 Baker Award given to the best partnership of the year, I have long been interested in applying my interest in analytics to debate. This had many manifestations, including creating a simple ELO metric for teams as a high school sophomore and organizing a custom fantasy debate league for my friends through a spreadsheet as a senior. As a freshman in college, while debating for the University of Michigan and ranked among the top 20 partnerships in the country, I created a tool to help scout and prepare for opponents.",
                            "Using Python and working in the Spyder IDE, I wrote a program that would scrape a website with tournament results and compile statistics on every single judge and partnership in the college circuit. I then stored results in dataframes organized by team or individual, and extracted metrics that gave valuable insight on things like judge tendencies and opponent strength on different sides of arguments. This data helped my team tailor our preparation to the opponents we considered most formidable and adapt our arguments to appeal to the specific judge watching any given debate round.",
                            "The tool I created automated a process that had previously been completed manually by a coach, taking valuable time away from argument and strategy development. This streamlined the entire team’s preparation and had valuable returns throughout the season. Creating the program also gave me experience using MySQL for database management, Pandas for splicing and organizing data of interest, and BeautifulSoup for web scraping."],
            "tags": ["Sports Analytics", "Python", "Spyder", "BeautifulSoup", "Pandas", "MySQL"],
            "thumbnail_src": "./assets/images/debate-clipart.webp",
            "img1_src": "./assets/images/debate-stats-table.png",
            "img1_cap": "A table with aggregated team statistics.",
            "img2_src": null,
            "img2_cap": null
        },
        {
            "id": "physics-research",
            "title": "Theoretical Physics Research",
            "subtitle": "Quantum Science Theory Lab",
            "description": ["Beginning my sophomore year, I have been working with the University of Michigan’s Quantum Science Theory Lab, led by Dr. Mack Kira. The group performs theoretical research in quantum science, focusing on quantum optics and spectroscopy.",
                            "I participate in the lab’s weekly meetings, where graduate students and postgraduate researchers share updates on the progress they have made. I have also had the privilege of learning from bright minds that are pursuing groundbreaking research in quantum optics with applications in emerging technology, including discussing my fellow group members’ research one-on-one, asking questions of Dr. Kira and the other students, and gaining an inside view into the research process and the challenges and opportunities it entails.",
                            "My experience with the group has prepared me for pursuing academic research later in my life, whether in a PhD program, at an academic institution, or as an innovator in industry or at a leading firm."],
            "tags": ["Research", "Physics", "Quantum Computing", "Math"],
            "thumbnail_src": "./assets/images/quantum-clipart.png",
            "img1_src": null,
            "img1_cap": null,
            "img2_src": null,
            "img2_cap": null
        },
        {
            "id": "cs-major",
            "title": "Computer Science Major",
            "subtitle": "University of Michigan",
            "description": ["Pursuing a major in Computer Science at the University of Michigan has built a strong foundation of fundamental concepts in CS, software engineering, and object oriented programming.",
                            "I have taken multiple classes in C++, including Data Structures and Algorithms, giving me an advanced understanding of its syntax, capabilities, and best practices. These classes have involved projects like implementing heuristics for the Travelling Salesperson Problem subject to strict time and space constraints, creating a program to simulate the execution of a bank (including handling user registration, transactions, and fraud detection), creating an interactive version of the card game Euchre (a staple of the Michigan experience), and implementing a seam-carving algorithm to resize photos while maintaining as much of the original as possible.",
                            "I have also taken multiple courses on core concepts in computer science theory and research. In these courses, I learned applications of essentials like the Pigeonhole Principle and recursion, got rigorous practice in more advanced algorithm families like multidimensional Dynamic Programming, and was introduced to the theory behind random algorithms, NP-completeness, and zero-knowledge proofs.",
                            "Other courses I have taken or am currently enrolled in cover Computer Architecture (including simulating hardware components like linkers and pipelined processors in C), Web Systems, Cryptography, and Cybersecurity.",
                            "My time as a CS student has also introduced me to many amazing, intelligent peers and professors who are eager and interested in discussing and collaborating on programming projects, always willing to share their inspiring backgrounds and professional experience, and constantly building and devising new products and ideas that blow me away with their novelty and ingenuity. I have no doubt that the students and mentors I have met will continue to influence me long after my undergraduate studies have ended."],
            "tags": ["C++", "C", "Data Structures", "Algorithms", "Software Development", "WSL", "Visual Studio Code", "Git"],
            "thumbnail_src": "./assets/images/block-m.png",
            "img1_src": null,
            "img1_cap": null,
            "img2_src": null,
            "img2_cap": null
        },
        {
            "id": "physics-major",
            "title": "Interdisciplinary Physics Major",
            "subtitle": "University of Michigan",
            "description": ["In addition to CS, I study Interdisciplinary Physics with a concentration in Quantum Computing in Michigan’s college of Literature, Science, and the Arts (LSA) honors program. Majoring in physics has contributed to a strong basis in math and an understanding of scientific research and discovery. The interdisciplinary program at Michigan has allowed me to tailor my studies to applications of physics in emerging technologies, extending my learning past the natural sciences to the broader sphere of tech development and engineering.",
                            "My courses for the major have spanned math, science, and technology. Through Honors Multivariable Calculus and Methods of Theoretical Physics, I have covered topics like differential equations, Fourier transforms, and multivariate integration. In core physics courses like Honors Physics III and Modern Physics, I have been introduced to quantum mechanics, particle physics, thermodynamics, and more. I have applied these skills directly in advanced lectures like Quantum Nanotechnology, demonstrating the translation from theory to engineering. I have also taken lab courses and programmed simulations of physical phenomena, building an instinctual understanding of the science.",
                            "Beyond classes, my interest in physics has opened the door to many valuable experiences, including developing quantum games in Python, participating in a quantum science research group, and attending the Quantum+Chips summer program, where I learned about semiconductor development and quantum computing through lectures from experts in both academia and industry as well as through lab tours, clean room tours, and company visits."],
            "tags": ["Physics", "Quantum Computing", "Linear Regression", "Math", "Python", "Jupyter Notebook"],
            "thumbnail_src": "./assets/images/block-m.png",
            "img1_src": null,
            "img1_cap": null,
            "img2_src": null,
            "img2_cap": null
        },
        {
            "id": "personal-website",
            "title": "Personal Portfolio Website",
            "subtitle": "Personal Project",
            "description": ["While working my 2024 summer internship, I also taught myself HTML, CSS, JavaScript, and React as a fun extracurricular. Starting with my background in CS and a basic understanding of web protocols, I learned the core principles of web development, HTML page structure, styling with CSS and Tailwind, dynamically pulling data through JSON queries, and making interactive pages with React.",
                            "To put my skills to use, I made this website! Starting with just an empty react project in npm, I built the site from start to finish, including planning the site layout, creating mockups for each page in Figma, building out the site navigation, styling every page, and making custom elements like project cards and tags to layout my portfolio in a unique and interesting fashion. Though simple, doing so helped solidify my understanding of the concepts and features I had learned and now provides a starting point for future iteration and improvement as my skills grow.",
                            "I hope that you’ve had a seamless experience using the site. All the code can be found on <a href=\"https://github.com/DMcDe/personal-website\" target=\"_blank\">my Github</a>."],
            "tags": ["HTML/CSS", "React JS", "JavaScript", "Git", "Figma", "Web Development", "Software Development"],
            "thumbnail_src": "./assets/images/react-logo.png",
            "img1_src": null,
            "img1_cap": null,
            "img2_src": null,
            "img2_cap": null
        }
    ]
}